{
    "title": "German court lifts ban on far-right magazine",
    "link": "https://www.bbc.com/news/articles/c2ezg4wzr8yo",
    "published": "Tue, 24 Jun 2025 11:57:21 GMT",
    "summary": "Judges said that while the magazine published anti-constitutional content, it did not justify a ban.",
    "full_text": "German court lifts ban on far-right magazine4 hours agoShareSaveDamien McGuinnessBBC News BerlinShareSaveGetty ImagesJ체rgen Els채sser, publisher of the far-right magazine CompactA court in Leipzig has lifted a ban imposed by the German government on the influential far-right magazine Compact.The ruling is seen by some as a blow to Germany's fight against right-wing extremism, although for others it could be proof of the country's high standards of free speech.In July 2024 the German interior ministry banned the magazine, arguing that it undermined the German constitution with rhetoric that attacked minorities.\"It is a central mouthpiece of the right-wing extremist scene,\" said German Interior Minister Nancy Faeser at the time. \"This magazine incites unspeakable hatred against Jews, against people with a migration background, and against our parliamentary democracy.\"The magazine is linked to the far-right Alternative for Germany party (AfD) and previously had been classed by German domestic intelligence as right-wing extremist.In Tuesday's ruling judges accepted that the magazine published anti-constitutional content, but decided this did not justify a ban.Many statements in Compact could be seen as \"exaggerated but permissible criticism,\" presiding Judge Ingo Kraft told the court. \"The constitution guarantees freedom of expression and freedom of the press, even towards enemies of the constitution.\"After the announcement, Compact's editor-in-chief J체rgen Els채sser, who described his magazine as \"democracy's assault gun\", said the ruling would also help the AfD party. If his magazine cannot be banned, then neither can the AfD, he said.There is a ferocious debate in Germany about whether to attempt to ban the AfD, which has also been classed as right-wing extremist by German intelligence. Even many critics of the AfD say a ban could be counterproductive by playing into the party's victim narrative.Over the past year, German officials have banned, or attempted to ban, a number of anti-constitutional organisations, some linked to far-right extremist groups. The AfD and far-right activists say they are being silenced by an oppressive state.Some supporters of Donald Trump have also accused Germany of suppressing free speech. At the Munich Security Conference in February US Vice President JD Vance stunned European officials with a blistering attack on Germany, accusing mainstream politicians of shutting the AfD out of politics and of an anti-democratic clampdown on free speech.In fact, AfD politicians are a staple of German TV talkshows and have equal debating rights to mainstream parties in the German parliament.Due to Germany's 20th-Century experience of oppressive Nazi and communist totalitarian regimes, there are high hurdles to restricting speech and banning publications and organisations.Cases often get taken to court and, as in this ruling, overturned by judges. The decision to allow the far-right magazine Compact to be published, cannot be appealed by the government.Germany defends AfD extremist classification after Rubio criticises 'tyranny in disguise'AfD classified as extreme-right by German intelligenceJD Vance attacks Europe over free speech and migrationGermanyAlternative for Germany (AfD)"
}