{
    "title": "Germany vows to pay its 'fair share' on defence as Nato prepares for summit",
    "link": "https://www.bbc.com/news/articles/c4gd98qry6jo",
    "published": "Tue, 24 Jun 2025 13:22:39 GMT",
    "summary": "The German chancellor says Nato leaders will aim to ensure peace in Europe for generations to come.",
    "full_text": "Germany promises fair share of Europe's defence as Nato leaders arrive at Hague summit2 hours agoShareSaveLaura Gozzi & Paul KirbyBBC NewsShareSaveReutersSecurity is tight at the Nato summit - President Trump's first since 2019German Chancellor Friedrich Merz has warned that Russia's president understands only the language of force and that Tuesday's \"historic\" Nato summit in The Hague will aim to ensure peace in Europe for generations to come.Merz told Germany's parliament hours before the summit was due to start that Vladimir Putin remained determined that Ukraine should be part of Russia, and he said Berlin would pay its \"fair share\" to defend Europe.US President Donald Trump is on his way to the Hague for his first Nato summit since 2019 where all 32 leaders are set to commit to spending 3.5% of national output on defence and a further 1.5% on related infrastructure.Ahead of a summit overshadowed by Israel-Iran conflict, Nato Secretary General Mark Rutte told his European colleagues to stop worrying about the US commitment to the Western alliance and focus on investing in defence and supporting Ukraine.He insisted the US president and senior leadership had a \"total commitment\" to Nato, that came with an expectation of matching American military spending.Rutte said Europe and Canada had already committed to more than $35bn (£26bn) in military support for Ukraine this year.Ten people were killed in Russian attacks on Ukraine on Tuesday, and the German chancellor said every attempt to bring Russia to the negotiating table had so far been unsuccessful.Missile attacks on the eastern city of Dnipro and the nearby town of Samar killed 11 people and wounded another 150, according to the regional chief Serhiy Lysak. A number of children were wounded in the attack on Dnipro, which damaged a kindergarten and a passenger train.An earlier missile strike on Sumy in the north-east killed three people, including a child.Ukraine's Volodymyr Zelensky, who has arrived in The Hague, is due to meet Donald Trump on the sidelines of the Nato summit. It would be their first encounter since they met at Pope Francis's funeral at the Vatican in April.Omar Havana/Getty ImagesZelensky (L) was greeted by the Nato secretary general on arrival at The HagueNato member states are expected to approve a major new investment plan which will raise the benchmark for defence investment to 5% of GDP.Many of the allies are far below the commitment to spend 3.5% of GDP on defence by 2035,  but the German government backed a budget deal on Tuesday to hit that target by 2029.Some €62.4bn (£53bn) will be spent on defence in 2025, rising to €152.8bn in 2029, partly financed by debt and special funds.\"We're not doing that as a favour to the US and its president, we're doing this out of our own view and conviction, because Russia is actively and aggressively endangering the security and freedom of the entire-Euro-Atlantic area.\"During the summit, Merz is due to meet UK Prime Minister Sir Keir Starmer and France's President Emmanuel Macron.Mark Rutte has spent much of the nine months since becoming Nato Secretary General working to get allies to commit to the 5% target. The figure is more than double Nato members' current 2% guideline and seemed unthinkable – and unrealistic – to most when President Trump first set it in January.The two-day Nato summit has been scaled back, so that after Tuesday's dinner hosted by the Dutch king, there will be a working session of under three hours on Wednesday and a five-paragraph statement, apparently to accommodate President Trump.Could this be the most significant Nato summit since the Cold War?32 nations but only Trump matters at Nato summitThe wording of the commitment in the statement is key.While 3.5% of of the target spending will cover core defence requirements, 1.5% will be spent on \"defence-related expenditure\" – a suitably broad expression that encompasses investments in anything from cybersecurity to infrastructure.Reaching the 3.5% core defence spending target will still require a significant adjustment for the majority of Nato countries. Out of 32 allies, 27 spend under 3%, with eight hovering well below the 2% threshold set by the alliance in 2014.On Monday, Prime Minister Keir Starmer pledged that the UK would meet the 5% target by 2035. He said the UK had to \"navigate this era of radical uncertainty with agility, speed and a clear-eyed sense of the national interest\". The UK government said it expected to spend 2.6% of GDP on core defence within two years, alongside 1.5% on defence-related areas.EPASpain's prime minister Pedro Sánchez has argued his country should be exempt from the 5% spending targetAt the bottom of the rung is Spain, whose defence spending is below 1.3%.Madrid would need to more than double its funding to meet Rutte's new target – something that Socialist Prime Minister Pedro Sánchez has long resisted, arguing it \"would not only be unreasonable but also counterproductive\".It would also, crucially, be unpopular at home – not least among his left-wing governing coalition – at a time when Sánchez's government is teetering.On Sunday Sánchez said Spain had reached a deal that would see it exempted from the target – something Rutte swiftly pushed back on. \"Nato is absolutely convinced Spain will have to spend 3.5% to get there,\" he said on Monday.Sánchez's suggestion of a lower spending threshold was enough for Belgium and Slovakia to also express interest in an exemption – denting Rutte's hard-won image of a united alliance.\"I can assure you that for weeks our diplomats have been working hard to obtain the flexibility mechanisms,\" said Belgium's foreign minister Maxime Prévot. Brussels' spending is currently at 1.3% - and Slovakia has also said it reserves the right to decide when to meet the new target.Despite their comments, all 32 states are expected to sign up to the new pledge.As Nato leaders and the leaders of more than a dozen partner states made their way to The Hague, train travel from Schiphol Airport near Amsterdam was badly disrupted after cables were damaged by fire.Security Minister David Van Weel said sabotage could not be ruled out. \"It could be an activist group, it could be another country. It could be anything,\" he told public broadcaster NOS. \"The most important thing now is to repair the cables and get the traffic moving again.\"GermanyFriedrich Merz"
}