{
    "title": "What we know about Iran's attack on US base in Qatar",
    "link": "https://www.bbc.com/news/articles/cdjxdgjpd48o",
    "published": "Tue, 24 Jun 2025 09:10:46 GMT",
    "summary": "Iranian missiles targeted the Al-Udeid air base in retaliation for US strikes on its nuclear sites.",
    "full_text": "What we know about Iran's attack on US base in Qatar6 hours agoShareSaveShareSaveVideo shows air defences over Qatar as Iran attacks US baseSean Seddon & Gabriela PomeroyBBC NewsIran launched missiles at a US military base in Qatar on Monday, in what it said was retaliation for American strikes against its nuclear sites over the weekend.Witnesses reported hearing loud bangs in the sky above the capital, Doha, while videos showed bright flashes in the sky as air defence systems attempted to intercept missiles.Donald Trump described the attack as \"very weak\" and \"expected\", and suggested peace in the region could proceed.On Tuesday, the US president announced a ceasefire between Israel and Iran had come into effect.Here is what we know.What did Iran target and why?Iranian missiles targeted the largest US military base in the Middle East, Al-Udeid, in what it said was a response to the US bombing three of its nuclear programme facilities on Saturday evening. Al-Udeid is home to the US military's headquarters for all air operations in the region. Some British military personnel also serve there on rotation. Iran launches missiles at US base in Qatar in response to strikesThe attack was first confirmed by Iranian state media, and later by the military.A statement from the IRGC, the most powerful branch of the Iranian military, said that \"Iran will not leave any attack on its sovereignty unanswered\", and added: \"US bases in the region are not strengths but vulnerabilities.\"The US had previously warned Iran not to respond to its strikes on nuclear facilities and urged leaders in Tehran to agree to a diplomatic end to hostilities in the region. There were differing reports about how many missiles were fired. Iran said six, the US said 14, and Qatar was reported by Reuters as saying 19 - all of which, it added, were intercepted. No one has been reported killed or injured.In the hours before the attack, both the US and UK had advised their citizens in Qatar to \"shelter in place\". About 8,000 US citizens live in Qatar, according to the State Department, as well as several thousand British citizens.What was said after the attackIt became apparent soon afterwards that Iran had given warning that it was preparing to launch missiles. Three Iranian officials quoted by the New York Times said that Tehran had told Doha of its intentions, as a way to minimise casualties.In his first comments in the aftermath, President Donald Trump thanked Iran \"for giving us early notice, which made it possible for no lives to be lost, and nobody to be injured\".He branded the attack \"very weak\" - no Americans were harmed and very little damage was done, he said. \"They've gotten it all out of their system,\" he added and said there was now a chance for \"peace\".Nevertheless, a spokesman for Qatar's foreign ministry said the attack was a \"surprise\" and a \"flagrant violation of its sovereignty\", and added that Qatar \"was one of the first countries to warn against the dangers of Israeli escalation in the region\".Iran's supreme leader Ayatollah Ali Khamenei meanwhile said that Iran did not harm anyone in the attack but that his country would not \"submit to anyone's violation\".\"We have not violated anyone, and we will in no way accept being violated by anyone. We will not submit to anyone's violation; this is the logic of the Iranian nation,\" he said on X (as translated by BBC Persian).On Tuesday, Israel publicly agreed to Trump's ceasefire proposal while Iran said it would only stop its attacks if Israel did the same.Iranian state media announced the country had fired \"a last round of missiles\" towards Israel before the ceasefire began.Meanwhile, the Israeli government issued a warning to Iran: \"Israel will respond forcefully to any violation of the ceasefire.\"What were the signs that the attack was imminent? There were indications on Monday that the US suspected Iran was preparing to launch missiles into Qatar.Hours before the attack, Qatar said it was temporarily closing its airspace, shortly after the US and UK told citizens in Qatar to \"shelter in place\".Those warnings did not give a clear indication an attack was imminent: the US said it issued the order \"out of an abundance of caution\", while the UK said it was following the lead of the Americans.However, around an hour before the attack, the BBC learned of \"a credible threat\" to the base. Separately, some US media outlets quoted anonymous US officials as saying Iranian missile launchers had been positioned for a potential launch towards Qatar.Flight tracking websites showed planes had already started diverting to other airports before the launch. According to Flightradar24, there were 100 flights bound for Doha shortly before missile launches were detected.Hamad International Airport is one of the world's top 10 busiest for international traffic, with around 140,000 passengers passing through per day.Other countries in the region, including Bahrain and Kuwait, also closed their airspace for a brief period.How did we get here?The US launched massive strikes against three nuclear facilities inside Iran on Saturday.That came after days of uncertainty over whether the US would join Israel's military action against Iran, which started on 13 June.Israel has been launching daily missile strikes against nuclear and military facilities inside Iran, which its government says are necessary to prevent Iran from imminently building a nuclear weapon.Successive Israeli and American governments have sought to prevent Iran from acquiring a nuclear weapon. Iran has always maintained its extensive nuclear programme is for civilian purposes. The US claimed its strikes badly damaged Iran's nuclear programme, though the full extent of their impact remains unclear.Attacks between Iran and Israel also continued on Sunday and Monday before the ceasefire took effect.RAF flight evacuates British nationals from IsraelWhat we know about US strikes on three Iranian nuclear sitesStrait of Hormuz: What happens if Iran shuts global oil corridor?IsraelIranQatarUnited States"
}