{
    "title": "What we know about US strikes on three Iranian nuclear sites",
    "link": "https://www.bbc.com/news/articles/cvg9r4q99g4o",
    "published": "Mon, 23 Jun 2025 14:29:31 GMT",
    "summary": "The sites targeted include a uranium enrichment facility at Fordo.",
    "full_text": "What we know about US strikes on three Iranian nuclear sites1 day agoShareSaveThomas Mackintosh & Nadine YousifBBC NewsShareSaveMaxar TechnologiesIran is weighing its response to US strikes carried out against its nuclear sites at the weekend, which American officials say have significantly set back the prospect of Tehran building a nuclear weapon.The strikes were launched as Israel and Iran continued to attack each other, after a long-simmering regional rivalry escalated into direct conflict earlier this month.The impact and wider implications of the US strikes on Iran are still becoming clear. Here is what we know so far.What has the US bombed, and what weapons did it use?The operation - codenamed Midnight Hammer - involved 125 US military aircraft and targeted three nuclear facilities: Fordo, Natanz and Isfahan. They were hit between 22:40 GMT and 23:05 GMT on Saturday (02:40-03:05 on Sunday Tehran time), the US said.US Gen Dan Caine, chairman of the joint chiefs of staff, disclosed more details during a press conference. He said: The aircraft took off from the US and made an 18-hour journey to Iran Some jets were sent west into the Pacific as a \"decoy\", while others went ahead of the main bombers to ensure airspace was clearSeven B-2 stealth bombers tasked with hitting the nuclear sites flew into Iran and avoided detectionAt the same time, two dozen cruise missiles were launched at the Isfahan site from a submarine - in total, 75 \"precision-guided weapons\" were used during the operationFourteen GBU-57 Massive Ordnance Penetrators (MOPs) were dropped on the Fordo site, a nuclear enrichment facility buried deep below a mountain outside Tehran, which is vital to Iran's nuclear ambitions.Only the US operates these huge so-called bunker buster bombs, the sole weapons that could conceivably reach the concealed site.The bombs weigh 13,000kg (30,000lb) and are able to penetrate 18m (60ft) of concrete or 61m (200ft) of earth before exploding.Shortly after the strikes, US President Donald Trump - who had been publicly calling for a deal to curb Iran's nuclear programme - made a televised address and said future attacks would be \"far greater\" if Iran did not agree to a deal, adding: \"Remember, there are many targets left.\"What is known about the impact of the attacks?In the hours that followed, Gen Caine said it would take time to assess the damage, but added an initial appraisal indicated \"that all three sites sustained extremely severe damage and destruction\".Since then, Trump has said the strikes caused \"monumental damage\", adding in a social media post: \"Obliteration is an accurate term.\"Satellite images taken on 22 June show six fresh craters clustered around two entry points at the Fordo nuclear site, most likely where the US bombs fell, as well as grey dust and debris scattered down the mountainside.Maxar TechnologiesNew satellite imagery taken on 22 June show fresh craters at the Fordo nuclear siteStu Ray, senior imagery analyst at McKenzie Intelligence Services, assessed those images for BBC Verify after the US confirmed MOPs were used. He said: \"You will not see a huge blast effect at the entry point as it is not designed to detonate on entry but deeper down into the facility.\"He also said satellite pictures appeared show tunnel entrances had been blocked off, which may have been an Iranian attempt to \"mitigate against deliberate targeting of the entrances by aerial bombardment\".The Iranian Atomic Energy Organization has called the bombing of the three nuclear sites a \"barbaric violation\" of international law, while the US has claimed the strikes have severely disrupted Iran's nuclear programme.However, Hassan Abedini, the deputy political director of Iran's state broadcaster, claimed the three sites targeted by the US had been evacuated a  \"while ago\", and that Iran \"didn't suffer a major blow because the materials had already been taken out\".Both Saudi Arabia and the UN's nuclear watchdog said there had been no increase in radiation levels after the attack. Follow live updatesWhat the US and Iran do next could be more momentousDecoy flights and seven B-2 stealth bombers - how US says it hit Iran's nuclear sitesWatch: How successful have the US strikes on Iran been?How might Iran retaliate, and what has happened since?There have been no further US strikes and senior American officials stressed they are not seeking a wider war with Iran.However, Trump has since floated the idea of \"regime change\", writing on social media \"if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn't there be a Regime change???\"It is still not clear how Iran will respond, though analysts have speculated that attacks on American military bases in the region and a blockade of the Strait of Hormuz - a narrow shipping lane off the Iranian coast that is critical to the global oil trade - are possible.On Sunday, Iranian President Masoud Pezeshkian said the US \"must receive a response for their aggression\", while Iran's representative to the UN said the country's military would weigh a \"proportionate response\".Iran's options fall into three broad categories, according to BBC security correspondent Frank Gardner: Do nothing - this could spare it from further US attacks, and Iran could even choose to rejoin negotiations with the US. But doing nothing makes the Iranian regime look weak, especially after all its warnings of dire repercussions. It may decide the risk of weakening its grip on its population outweighs the cost of further US attacksRetaliate hard and fast - Iran still has a substantial arsenal of ballistic missiles after manufacturing and hiding these away for years. It has a target list of around 20 US bases to choose from in the broader Middle East, and could also launch \"swarm attacks\" on US Navy warships using drones and fast torpedo boatsRetaliate later at a time of its own choosing - this would mean waiting until tension has subsided and launching a surprise attack when US bases were no longer on maximum alertMeanwhile, the conflict between Iran and Israel continues. Iran launched a barrage of missiles at Tel Aviv and Haifa in the hours after the US strikes, injuring 86 according to Israel.On Monday, the Israeli military said it had targeted Fordo again, aiming to \"disrupt access routes\". It also targeted the notorious Evin prison, where critics of the Iranian regime have been held, including foreign nationals. Footage showed damage to the gates of the prison, though there are no reports of inmates escaping. How has the world reacted to the US strikes?The UK, France and Germany reiterated that Iran could not be allowed nuclear weapons, and urged Iran to enter talks.On Monday UK Foreign Secretary David Lammy said Iran's leaders \"have to get serious about the off-ramp that is being made available to them\".UN Secretary General António Guterres said the US strikes were a dangerous escalation, while European Union foreign policy chief Kaja Kallas urged all sides to return to the negotiating table.Gulf nations have called for de-escalation in the region.On Monday, Russian President Vladimir Putin hosted Iran's foreign minister at the Kremlin and accused the US of \"violating international rules\". In the US, top Republican figures have been broadly supportive of the move, while senior Democrat Hakeem Jeffries accused the president of bypassing Congress and risking \"entanglement in a potentially disastrous war\".Trump says Iran must make peace or face future attacks after US strikesHow did this start?On 13 June, Israel launched a surprise attack on dozens of Iranian nuclear and military targets.Israeli Prime Minister Benjamin Netanyahu said Iran was close to being able to produce a bomb. Iran has always insisted its nuclear programme is peaceful.Iran responded by launching strikes against Israel, and an air war between the two has continued since.Trump has long sought to bring Iran to abandon its nuclear ambitions, and the two countries were engaged in talks when the US launched the strike.Israel is widely believed to possess nuclear weapons but neither confirms nor denies this in public.In March, US national intelligence director Tulsi Gabbard said that while Iran had increased its uranium stockpile to unprecedented levels, it was not building a nuclear weapon - an assessment Trump recently said was \"wrong\".Iran-US relationsUnited StatesMiddle EastDonald Trump"
}