{
    "title": "Remembering India's iconic crocodile-hunting tigress",
    "link": "https://www.bbc.com/news/articles/c77vj7v74lmo",
    "published": "Tue, 24 Jun 2025 05:50:19 GMT",
    "summary": "Arrowhead, also known as T-84, died last week in India's Ranthambore national park.",
    "full_text": "Remembering India's iconic crocodile-hunting tigress10 hours agoShareSaveCherylann MollanBBC News, MumbaiShareSaveSachin RaiArrowhead got her name from the arrow-shaped stripe on her cheekIndian wildlife photographer Sachin Rai still remembers tigress \"Arrowhead\" pouncing on a crocodile and tearing away its leathery flesh with her teeth.Mr Rai had been photographing the iconic tigress in western Rajasthan state's Ranthambore National Park since she was a cub.Last week, Arrowhead, also known as T-84, died at the age of 11 near a stretch of lakes in the scenic park, the very territory she had gloriously ruled over in her prime.Her death, caused by an illness, was mourned by hundreds of wildlife enthusiasts, photographers and tour guides who had flocked to the park to get a glimpse of her.Arrowhead's legendary status comes partly from her lineage; she is the daughter of Krishna and granddaughter of Machli - majestic tigresses who, once upon a time, dominated vast home ranges in Ranthambore with ferocity. They were also skilled crocodile-killers, known to incapacitate the massive creatures by crushing their skulls in their powerful jaws.Sachin RaiArrowhead ruled over her vast home range with ferocityMr Rai says that Arrowhead - named such by another wildlife photographer after the distinct arrow-shaped stripes on her cheek - took to killing crocodiles after her health began failing her.\"But even though she was weak and frail, the crocodiles were no match for her,\" Mr Rai says.Her kills earned her the nickname \"crocodile-hunter\" by her fans, he adds. In fact, she killed a crocodile just days before her death.Though graceful and fierce, Arrowhead had a difficult life, Mr Rai says. She was chased out of her territory by her own daughter, Riddhi, and had to mate multiple times in order to find a place she could call home. (A male tiger shares his territory with his mate, offering her a space to bring up their cubs.)Sachin RaiArrowhead strolls through her territory in Ranthambore national parkSachin RaiThis image captures Arrowhead (right) chasing away a tiger she did not want to mate withArrowhead gave birth to four litters in her lifetime, but not all of her children survived.She grew weak after developing a tumour and park official's would have to bring her food when she couldn't hunt for days. However, this was stopped after some of her cubs attacked and killed people.Mr Rai, who was around when Arrowhead was nearing her end, says that it was heart-breaking to see a powerful, majestic creature become so weak and powerless.\"I saw her struggling to walk. Every step seemed like an effort and she kept falling down,\" he says.Interestingly, Arrowhead ventured into her daughter Riddhi's territory - which was once her own - in her last days. \"Riddhi didn't put up a fight. She just gave her mother space to lie down and rest,\" Mr Rai says, tearing up.Sachin RaiArrowhead ruled over a stretch of lakes in RanthamboreAdditional reporting by Antriksha PathaniaFollow BBC News India on Instagram, YouTube, Twitter and Facebook.Tiger conservationAsiaTigersIndia"
}