{
    "title": "Wildfires rage on Greek island of Chios",
    "link": "https://www.bbc.com/news/articles/cz09lmngyv2o",
    "published": "Mon, 23 Jun 2025 15:58:43 GMT",
    "summary": "A state of emergency is declared and an arson investigation launched after five separate fires were sparked within hours.",
    "full_text": "Wildfires rage on Greek island of Chios24 hours agoShareSaveNikos Papanikolaou & Tiffany WertheimerBBC NewsShareSaveREUTERS/Konstantinos AnagnostouFirefighters from Athens and Thessaloniki were deployed to the island on MondayA state of emergency has been declared on the Greek island of Chios where five separate wildfires are burning and being fanned by strong winds.Residents in 17 communities have been evacuated and an arson investigation has been launched into what caused the different fronts to start is such a short amount of time.Three forest fires broke out on Sunday in the areas of Kofinas, Agia Anna and Agios Makarios. A fourth blaze erupted shortly after midnight in Agios Markos, followed by a fifth front on Monday morning in Agiasmata.The blaze has already damaged homes, crops and infrastructure on the Aegean island, with local media reporting that several houses have been destroyed.There is a moderate high temperature warning on Chios, with highs of about 30C, but it is expected to get hotter toward the end of the week.About 190 firefighters were operating on the island, supported by 11 aircraft and helicopters. An additional 90 firefighters are also due to arrive from Athens and Thessaloniki, authorities said.Pictures from the island show locals trying to help firefighters, throwing buckets of water on flames and using clothing to try to pat out smaller spot fires.Local media reported extensive damage to a number of houses and at least one distillery, with some residents saying they had been unable to return to see if their property had been damaged.Getty ImagesLocals have been helping firefighters across the islandClimate Crisis and Civil Protection Minister Ioannis Kefalogiannis travelled to Chios, and said after an emergency meeting that he is \"troubled and concerned\" about the outbreak of multiple fires in different parts of the island \"without a clear explanation\".\"This is something that must be investigated thoroughly,\" he added.Meanwhile, a team from the fire service's Arson Investigation Unit, working alongside local police officers, has launched an investigation into what caused the fires.The local power grid has been damaged by the fires, causing outages in the wider Vrontados area. Teams from the Hellenic Electricity Distribution Network (HEDNO) have been sent from the neighbouring island of Lesvos to carry out repairs. Some planned power cuts have also been introduced to support firefighting operations. Water supply issues and damage to infrastructure have also been reported.This is the first major wildfire this summer for Greece, which is no stranger to devastating fires and extreme heat.On Chios, an intense wildfire in 2012 wiped out more than half of the island's iconic mastic - a tree resin used in cooking and pharmaceuticals - disrupting the global supply of the so-called \"tears of Chios\".GreeceWildfires"
}